backend/app/graphql/mutations/create_post.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at", "country_code") VALUES ('わわあわ', 'わわわ', 10, '2025-09-07 06:05:23.844583', '2025-09-07 06:05:23.844583', 'vietnam') RETURNING "id"
---
    def resolve(title:, content:, country_code:)
      return { post: nil, errors: ['ログインが必要です'] } unless context[:current_user]

      post = context[:current_user].posts.build(
        title: title,
        content: content,
        country_code: country_code
      )

      if post.save