backend/app/graphql/mutations/login.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'nao.shiba.public@gmail.com' LIMIT 1
---
    def resolve(email:, password:)
      user = User.find_by(email: email)