backend/app/graphql/mutations/signup.rb

    def resolve(name:, email:, password:, password_confirmation:)
      user = User.new(
        name: name,
        email: email,
        password: password,
        password_confirmation: password_confirmation
      )

      if user.save
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at", "password_digest", "bio", "location", "website", "avatar_url", "reset_password_token", "reset_password_sent_at") VALUES ('nao.shiba.2003@gmail.com', 'naoki', '2025-09-07 06:00:50.217953', '2025-09-07 06:00:50.217953', '$2a$12$VV4VTjFi5Xme0nCNbZXZrOoDw3tVGcPSD7yL5oDhgzj6z0HlP.k/.', NULL, NULL, NULL, NULL, NULL, NULL) RETURNING "id"