backend/app/graphql/mutations/update_profile.rb

    def resolve(name: nil, email: nil, bio: nil, location: nil, website: nil, avatar_url: nil)
      user = context[:current_user]

      return { user: nil, errors: ["ログインが必要です"] } unless user

      # 更新可能な属性のみを更新
      user.name = name if name.present?
      user.email = email if email.present?
      user.bio = bio if bio.present?
      user.location = location if location.present?
      user.website = website if website.present?
      user.avatar_url = avatar_url if avatar_url.present?

      if user.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "name" = '田中太', "updated_at" = '2025-06-28 13:52:23.373744' WHERE "users"."id" = 1