backend/app/graphql/types/query_type.rb

      scope = User.all.order(id: :asc)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1