backend/app/controllers/api_v1_countries_controller.rb

  def stats
    # N+1クエリを避けるため、事前に統計情報を取得
    country_stats = Post.group(:country_id)
                        .select('country_id, COUNT(*) as tip_count, MAX(created_at) as last_post_date')
                        .index_by(&:country_id)

    # すべての投稿を一度に取得して、Ruby側でグループ化（N+1を完全に回避）
    # 各カ国ごとに最新2件のみを保持
    all_posts = Post.includes(:user)
                     .order(created_at: :desc)
                     .to_a
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."country_id" = 1
SELECT "posts".* FROM "posts" WHERE "posts"."country_id" = 1 ORDER BY "posts"."created_at" DESC LIMIT 2