backend/app/controllers/api_v1_auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'nao.shiba.2003@gmail.com' LIMIT 1
---
  def login
    email = params[:email]
    password = params[:password]

    user = User.find_by(email: email)

INSERT INTO "users" ("email", "name", "created_at", "updated_at", "password_digest", "bio", "location", "website", "avatar_url", "reset_password_token", "reset_password_sent_at") VALUES ('nao.shiba.2003@gmail.com', 'naoki', '2025-09-27 15:51:07.710210', '2025-09-27 15:51:07.710210', '$2a$12$f1FlhuP3hkBAABnsnlHQfOMNvhPz8p3gZjkfgVGqXKykUg3GCcIXe', NULL, NULL, NULL, NULL, NULL, NULL) RETURNING "id"
---
  def signup
    Rails.logger.debug "Signup params: #{params.inspect}"
    user = User.new(user_params)

    if user.save