backend/app/controllers/api_v1_posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (11, 10)
SELECT MAX("posts"."created_at") FROM "posts" WHERE "posts"."country_id" = 9
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."country_id" = 9 ORDER BY "posts"."created_at" DESC LIMIT 2
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT 20 OFFSET 0
---
  def index
    posts = Post.includes(:user, :country).order(created_at: :desc)
    posts = posts.where(country_id: params[:country_id]) if params[:country_id].present?

    # ページネーション
    if params[:page] && params[:per_page]
      page = params[:page].to_i
      per_page = params[:per_page].to_i
      posts = posts.limit(per_page).offset(per_page * (page - 1))
    end

    render json: {
      posts: posts.map do |post|