backend/app/controllers/api_v1_users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
---
  def authenticate_user
    token = request.headers['Authorization']&.gsub('Bearer ', '')
    return render json: { error: '認証が必要です' }, status: :unauthorized unless token

    payload = JwtService.decode(token)
    return render json: { error: '無効なトークンです' }, status: :unauthorized unless payload

    @current_user = User.find_by(id: payload['user_id'])