backend/app/controllers/graphql_controller.rb

  def current_user
    token = request.headers['Authorization']&.gsub('Bearer ', '')
    return nil unless token

    payload = JwtService.decode(token)
    return nil unless payload

    User.find_by(id: payload['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1