backend/app/controllers/api/v1/auth_controller.rb

  def login
    email = params[:email]
    password = params[:password]

    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'test@example.com' LIMIT 1