backend/app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (11, 10)
SELECT "posts".* FROM "posts" WHERE "posts"."country_code" = 'ireland' ORDER BY "posts"."created_at" DESC LIMIT 20 OFFSET 0
---
  def index
    posts = Post.includes(:user).order(created_at: :desc)
    posts = posts.where(country_code: params[:country_code]) if params[:country_code].present?

    # ページネーション
    if params[:page] && params[:per_page]
      page = params[:page].to_i
      per_page = params[:per_page].to_i
      posts = posts.limit(per_page).offset(per_page * (page - 1))
    end

    render json: {
      posts: posts.map do |post|

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at", "country_code") VALUES ('REST APIテスト投稿', 'これはREST APIからのテスト投稿です。197カ国から選択できるようになりました！', 11, '2025-09-07 06:30:00.911969', '2025-09-07 06:30:00.911969', 'japan') RETURNING "id"
---
  def create
    post = current_user.posts.build(post_params)

    if post.save